InformationRegisters/КонтрольПродажиЦеновыхГруппПоРегионам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КонтрольПродажиЦеновыхГруппПоРегионам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ЦеноваяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Монополия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтслеживатьКонкуренцию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КонтрольПродажиЦеновыхГруппПоРегионам/Ext/ManagerModule.bsl
Функция ПроверитьЗапись(СтруктураЗаписи, Отказ) Экспорт
	
	Если СтруктураЗаписи.Свойство("Монополия")              И ЗначениеЗаполнено(СтруктураЗаписи.Монополия) И
		 СтруктураЗаписи.Свойство("ОтслеживатьКонкуренцию") И ЗначениеЗаполнено(СтруктураЗаписи.ОтслеживатьКонкуренцию) Тогда
		
		Отказ = Истина;
		
		Возврат "Для включения еще одного режима контроля продажи по этой ценовой группе необходимо добавить новую запись !";
		
	КонецЕсли;
	
	Если СтруктураЗаписи.Свойство("Монополия") И ЗначениеЗаполнено(СтруктураЗаписи.Монополия) Тогда
		
		ТекстОшибки = ПроверитьМонополию(СтруктураЗаписи.ЦеноваяГруппа, СтруктураЗаписи.Монополия);
		
		Если Не ПустаяСтрока(ТекстОшибки) Тогда
			
			Отказ = Истина;
			
			Возврат ТекстОшибки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтруктураЗаписи.Свойство("ОтслеживатьКонкуренцию") И ЗначениеЗаполнено(СтруктураЗаписи.ОтслеживатьКонкуренцию) Тогда
		
		ТекстОшибки = ПроверитьОтслеживаниеКонкуренции(СтруктураЗаписи.ЦеноваяГруппа, СтруктураЗаписи.ОтслеживатьКонкуренцию);
		
		Если Не ПустаяСтрока(ТекстОшибки) Тогда
			
			Отказ = Истина;
			
			Возврат ТекстОшибки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ПроверитьМонополию(ЦеноваяГруппа, Контрагент)
	
	Если Контрагент.ТорговыеТочки.Количество() = 0 Тогда
		
		Возврат "У контрагента """ + СокрЛП(Контрагент) + """ нет ни одной торговой точки !";
		
	КонецЕсли;
	
	Выборка = РегистрыСведений.КонтрольПродажиЦеновыхГруппПоРегионам.Выбрать(Новый Структура("ЦеноваяГруппа", ЦеноваяГруппа));
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.Монополия) Тогда
			
			Если Выборка.Монополия = Контрагент Тогда
				
				Возврат "Монополия по этой ценовой группе уже закреплена за контрагентом """ + СокрЛП(Контрагент) + """ !";
				
			КонецЕсли;
			
			Для Каждого СтрокаТЧ Из Контрагент.ТорговыеТочки Цикл
				
				Запрос = Новый Запрос;
				
				Запрос.Текст = 
				
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	&Регион В ИЕРАРХИИ (&Регионы) КАК РегионыСвязаны";
				
				
				Запрос.УстановитьПараметр("Регион" , СтрокаТЧ.Регион);
				Запрос.УстановитьПараметр("Регионы", Выборка.Монополия.ТорговыеТочки.ВыгрузитьКолонку("Регион"));
				
				ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
				
				Если ВыборкаЗапроса.Следующий() Тогда
					
					Если ВыборкаЗапроса.РегионыСвязаны Тогда
						
						Возврат "Монополия по этой ценовой группе уже закреплена за контрагентом """ + СокрЛП(Выборка.Монополия) + """ !";
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Для Каждого СтрокаТЧ Из Выборка.Монополия.ТорговыеТочки Цикл
				
				Запрос = Новый Запрос;
				
				Запрос.Текст = 
				
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	&Регион В ИЕРАРХИИ (&Регионы) КАК РегионыСвязаны";
				
				
				Запрос.УстановитьПараметр("Регион" , СтрокаТЧ.Регион);
				Запрос.УстановитьПараметр("Регионы", Контрагент.ТорговыеТочки.ВыгрузитьКолонку("Регион"));
				
				ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
				
				Если ВыборкаЗапроса.Следующий() Тогда
					
					Если ВыборкаЗапроса.РегионыСвязаны Тогда
						
						Возврат "Монополия по этой ценовой группе уже закреплена за контрагентом """ + СокрЛП(Выборка.Монополия) + """ !";
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.ОтслеживатьКонкуренцию) Тогда
			
			Для Каждого СтрокаТЧ Из Контрагент.ТорговыеТочки Цикл
				
				Запрос = Новый Запрос;
				
				Запрос.Текст = 
				
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	&Регион1 В ИЕРАРХИИ (&Регион2) КАК РегионыСвязаны";
				
				
				Запрос.УстановитьПараметр("Регион1", СтрокаТЧ.Регион);
				Запрос.УстановитьПараметр("Регион2", Выборка.ОтслеживатьКонкуренцию);
				
				ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
				
				Если ВыборкаЗапроса.Следующий() Тогда
					
					Если ВыборкаЗапроса.РегионыСвязаны Тогда
						
						Возврат "По этой ценовой группе уже ведется отслеживание конкуренции по региону """ + СокрЛП(Выборка.ОтслеживатьКонкуренцию) + """ !";
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Запрос = Новый Запрос;
			
			Запрос.Текст = 
			
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	&Регион В ИЕРАРХИИ (&Регионы) КАК РегионыСвязаны";
			
			
			Запрос.УстановитьПараметр("Регион" , Выборка.ОтслеживатьКонкуренцию);
			Запрос.УстановитьПараметр("Регионы", Контрагент.ТорговыеТочки.ВыгрузитьКолонку("Регион"));
			
			ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
			
			Если ВыборкаЗапроса.Следующий() Тогда
				
				Если ВыборкаЗапроса.РегионыСвязаны Тогда
					
					Возврат "По этой ценовой группе уже ведется отслеживание конкуренции по региону """ + СокрЛП(Выборка.ОтслеживатьКонкуренцию) + """ !";
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат "";
	
КонецФункции

Функция ПроверитьОтслеживаниеКонкуренции(ЦеноваяГруппа, Регион)
	
	Выборка = РегистрыСведений.КонтрольПродажиЦеновыхГруппПоРегионам.Выбрать(Новый Структура("ЦеноваяГруппа", ЦеноваяГруппа));
	
	Пока Выборка.Следующий() Цикл
		
		//Если ЗначениеЗаполнено(Выборка.ОтслеживатьКонкуренцию) Тогда
		//	
		//	Если Выборка.ОтслеживатьКонкуренцию = Регион Тогда
		//		
		//		Возврат "Отслеживание конкуренции по этой ценовой группе уже ведется по региону """ + СокрЛП(Регион) + """ !";
		//		
		//	КонецЕсли;
		//	
		//	Запрос = Новый Запрос;
		//	
		//	Запрос.Текст = 
		//	
		//		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		//		|	&Регион1 В ИЕРАРХИИ (&Регион2)
		//		|		ИЛИ &Регион2 В ИЕРАРХИИ (&Регион1) КАК РегионыСвязаны";
		//	
		//	
		//	Запрос.УстановитьПараметр("Регион1", Регион);
		//	Запрос.УстановитьПараметр("Регион2", Выборка.ОтслеживатьКонкуренцию);
		//	
		//	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
		//	
		//	Если ВыборкаЗапроса.Следующий() Тогда
		//		
		//		Если ВыборкаЗапроса.РегионыСвязаны Тогда
		//			
		//			Возврат "Отслеживание конкуренции по этой ценовой группе уже ведется по региону """ + СокрЛП(Выборка.ОтслеживатьКонкуренцию) + """ !";
		//			
		//		КонецЕсли;
		//		
		//	КонецЕсли;
		//	
		//КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.Монополия) Тогда
			
			Запрос = Новый Запрос;
			
			Запрос.Текст = 
			
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	&Регион В ИЕРАРХИИ (&Регионы) КАК РегионыСвязаны";
			
			
			Запрос.УстановитьПараметр("Регион" , Регион);
			Запрос.УстановитьПараметр("Регионы", Выборка.Монополия.ТорговыеТочки.ВыгрузитьКолонку("Регион"));
			
			ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
			
			Если ВыборкаЗапроса.Следующий() Тогда
				
				Если ВыборкаЗапроса.РегионыСвязаны Тогда
					
					Возврат "По этой ценовой группе уже закреплена монополия за контрагентом """ + СокрЛП(Выборка.Монополия) + """ !";
					
				КонецЕсли;
				
			КонецЕсли;
			
			Для Каждого СтрокаТЧ Из Выборка.Монополия.ТорговыеТочки Цикл
				
				Запрос = Новый Запрос;
				
				Запрос.Текст = 
				
					"ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	&Регион1 В ИЕРАРХИИ (&Регион2) КАК РегионыСвязаны";
				
				
				Запрос.УстановитьПараметр("Регион1", СтрокаТЧ.Регион);
				Запрос.УстановитьПараметр("Регион2", Регион);
				
				ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
				
				Если ВыборкаЗапроса.Следующий() Тогда
					
					Если ВыборкаЗапроса.РегионыСвязаны Тогда
						
						Возврат "По этой ценовой группе уже закреплена монополия за контрагентом """ + СокрЛП(Выборка.Монополия) + """ !";
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат "";
	
КонецФункции
